Revit 2027 API
ParameterTypeId.FabricationPartWidthInOption Property
 "Main Primary Width Option"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId FabricationPartWidthInOption { get; }
Public Shared ReadOnly Property FabricationPartWidthInOption As ForgeTypeId
	Get
public:
static property ForgeTypeId^ FabricationPartWidthInOption {
	ForgeTypeId^ get ();
}
static member FabricationPartWidthInOption : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace